doc/learn_ettercap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>使用 ettercap</title>
<!-- 2015-05-22 五 13:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">使用 ettercap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 编译</a></li>
<li><a href="#sec-2">2. 运行</a></li>
<li><a href="#sec-3">3. 插件使用</a></li>
<li><a href="#sec-4">4. 报文流程说明</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 编译</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
cd ./ettercap
cd ./build
cmake -DENABLE_CURSES=OFF -DENABLEf_GTK=OFF ../
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 运行</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> -T </dt><dd>Text mode
</dd>
<dt> -q </dt><dd>Quiet mode
</dd>
<dt> -z </dt><dd>Do not perform the initial ARP scan of the LAN
</dd>
<dt> -u </dt><dd>prevent disable ip forward
</dd>
<dt> -f </dt><dd>pcapfilter, same as tcpdump
</dd>
<dt> -P </dt><dd>select plugin
</dd>
</dl>

<p>
命令:
</p>
<pre class="example">
sudo ettercap -i eth0 -Tzqu -f "tcp port 80" -P dummy
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 插件使用</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>使用源码提供的 dummy 小程序，Plugin 以so动态库形式被主程序调用，报文从 HTTP 钩子获取
</li>
<li>数据库的操作在 Plugin 中进行 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 报文流程说明</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
loop {

      receives a single packet from the pcap callback

      updates the packet statistics

      dump the packet to a file (if the user has requested it)

      if (truncated) continue;

      creates the packet object

      determine the interface where the packet was captured

      HOOK POINT: HOOK_RECEIVED

      starts the protocol decoding
         -&gt; the packet is decoded by decoder and the po is filled
            -&gt; the ip and tcp sessions are created

         -&gt; the middle layer is called (only if TCP or UDP)
            -&gt; if (PO_DONT_DISSECT) return;
            -&gt; set the PO_IGNORE according to the visualization filters
            -&gt; HOOK POINT: HOOK_HANDLED
            -&gt; if (PO_IGNORE) return;
            -&gt; execute the dissectors
            -&gt; HOOK POINT: HOOK_DECODED
            -&gt; execute the filtering engine
            -&gt; HOOK POINT: HOOK_FILTER
            -&gt; a copy of the packet is added to the top_half queue

      if (PO_FORWARDABLE) {
         HOOK POINT: HOOK_PRE_FORWARD
         forward the packet to the real host (the victim)
      }

      destroy the packet object

   }
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-05-22 五 13:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
